[
        {
            "numid": 1,
            "name": "Temperatura y Humedad",
            "collectionName": "Hygrothermograph",
            "allowed_params": ["propiedad", "min", "max"],
            "desc": "El higrotermógrafo es una herramienta importante para darnos datos sobre la temperatura y la humedad de nuestro ambiente. Aquí  utilizaremos la raspberry  Pi para leer los datos de Temperatura y Humedad del Módulo DHT11.",
            "uso": "Medir temperatura y humedad en la sala",
            "exampleQueryDateRange": "/sensores/1?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z",
            "exampleQueryTempRange": "/sensores/1?propiedad=temp&min=5.0&max=21",
            "exampleQueryHumidityRange": "/sensores/1?propiedad=humidity&min=5.0&max=21",
            "visible": "true",
            "realtime": "true"            
        },
        { 
            "numid": 2,
            "name": "Conmutador y Servomotor", 
            "collectionName": "conmutador", 
            "allowed_params": ["estado"], 
            "desc": "String: valor de cambio de la vía en un sentido u otro. Ejemplo: 1 = activada vía de servicio, 2 = activada vía normal",
            "uso": "Cuando se use el conmutador el servomotor deberá girar en cierto sentido. Esto permitirá controlar el cambio de las vías del tren.",
            "exampleQueryDateRange": "/sensores/2?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z",
            "exampleQueryEstado": "/sensores/2?estado=1", 
            "visible": "true", 
            "realtime": "true"
        },
        { 
            "numid": 3,
            "name": "Ultrasonido", 
            "collectionName": "ultrasonido", 
            "allowed_params": ["mayorque", "menorque", "igualque"], 
            "desc": "El módulo de alcance por ultrasonidos utiliza el principio de que las ondas ultrasónicas se reflejarán cuando encuentren obstáculos. Esto es posible contando el intervalo de tiempo entre el momento en que se transmite la onda ultrasónica hasta que la onda ultrasónica se refleja después de encontrar un obstáculo.", 
            "uso": "Se utilizará para medir la distancia de ciertos objetos. En primera instancia sería la altura de la grúa", 
            "exampleQueryDateRange": "/sensores/3?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z", 
            "visible": "true", 
            "realtime": "true"
        },
        { 
            "numid": 4,
            "name": "Fotorresistor", 
            "collectionName": "fotorresistor", 
            "allowed_params": ["orden"], 
            "desc": "La resistencia de una fotorresistencia cambiará en proporción a la luz ambiente detectada.", 
            "uso": "Este sensor va a simular el encendido y apagado de farolas, representadas por luces LED. Debe trabajar en conjunto con el PIR Sensor y con las siguientes condiciones. Encender el LED si PIR  y el Fotorresistor <=0. Esto se conseguiría tapando totalmente el sensor de luminosidad.", 
            "exampleQueryDateRange": "/sensores/4?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z", 
            "visible": "true", 
            "realtime": "true"
        },
        {
            "numid": 5,
            "name": "RFID",
            "collectionName": "rfid",
            "allowed_params": [],
            "desc": "RFID (Identificación por Radiofrecuencia) es una forma de tecnología de comunicación inalámbrica. Un sistema RFID generalmente está compuesto por un transpondedor y un lector. El transpondedor, comúnmente conocido como etiqueta, tiene un código único adjunto a un objeto para identificar el objeto objetivo. El lector es un dispositivo que lee (o escribe) información de la etiqueta.",
            "uso": "Este sensor se utilizará para simular un sistema de peaje para el tren de carga. El tren llevará el transpondedor adjunto como un llavero en el primer vagón. Luego, habrá una pequeña torre ubicada en un lugar específico sobre la vía del tren donde se encuentra el lector. Cada vez que el tren pase por la torre, se leerá el transpondedor, lo que permitirá calcular el número de veces que el tren ha pasado en una sesión.",
            "exampleQueryDateRange": "/sensores/5?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z",
            "visible": "true",
            "realtime": "true"
        }, 
        {
            "numid": 6,
            "name": "PIR Sensor",
            "collectionName": "pir",
            "allowed_params": [],
            "desc": "Este sensor de movimiento por infrarrojos puede detectar el espectro infrarrojo (firmas de calor) emitido por seres humanos vivos y animales vivos.",
            "uso": "Este sensor lo utilizaremos para detectar cuando alguien entra en la sala y va a tener dos objetivos.\n\n1. Encender un LED indicando que el sensor ha detectado la presencia.\n2. Funcionamiento en conjunto con un Sensor de luminosidad para que si el PIR envía una señal de que hay presencia y cuando se cubra el sensor de luminosidad se enciendan ciertas luces LED (Simularía el encendido de farolas siempre y cuando haya alguien en la sala).",
            "exampleQueryDateRange": "/sensores/6?desde=2024-05-06T22:53:14.205Z&hasta=2024-05-07T01:12:15.758Z",
            "visible": "true",
            "realtime": "true"
        }
]
